{
  "project": "pdfplumber-rs",
  "branchName": "ralph/phase12-advanced-features",
  "description": "Phase 12: Advanced Features - Tagged PDF operators, merged cells, header/footer detection, multi-column layout",
  "userStories": [
    {
      "id": "US-092",
      "title": "Wire tagged PDF operators (BMC/BDC/EMC) in interpreter",
      "description": "Structure tree extraction exists but the interpreter doesn't parse BMC/BDC/EMC operators from content streams. Maintain a tag/MCID stack in the interpreter, expose mcid and tag fields on Char objects for semantic extraction. Resolves #82.",
      "acceptanceCriteria": [
        "Interpreter handles BMC operator: pushes tag name onto marked content stack",
        "Interpreter handles BDC operator: pushes tag name and properties dict (including /MCID) onto stack",
        "Interpreter handles EMC operator: pops from marked content stack",
        "Char struct gains: mcid (Option<u32>), tag (Option<String>) fields",
        "Characters emitted between BDC/EMC inherit the current MCID and tag",
        "Nested marked content regions handled correctly (stack-based)",
        "MCID values can be correlated with StructTreeRoot elements",
        "Unit tests: BDC with MCID sets char.mcid, nested BMC/EMC maintains correct stack, EMC without matching BMC is gracefully handled",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 1,
      "passes": true,
      "relatedIssue": 82,
      "notes": "Enables logical reading order and semantic extraction for accessible PDFs."
    },
    {
      "id": "US-093",
      "title": "Add merged cell content duplication for tables",
      "description": "When extracting tables with merged/spanning cells, only the first cell contains text while others return None. Add a duplicate_merged_content boolean to TableSettings that fills all sub-cells of a merge with the spanning cell's content. Resolves #87.",
      "acceptanceCriteria": [
        "duplicate_merged_content: bool field added to TableSettings (default false)",
        "Detects merged cells by identifying missing internal borders between adjacent cells where one has content and neighbors are empty",
        "Handles horizontal merges (column spans): content duplicated across columns",
        "Handles vertical merges (row spans): content duplicated across rows",
        "Original cell content preserved unchanged when option is disabled",
        "Unit tests: 2x2 merge duplicated, column span duplicated, row span duplicated, disabled option returns None for merged cells",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 2,
      "passes": true,
      "relatedIssue": 87,
      "notes": "Common request for data pipeline consumers who expect uniform table structures."
    },
    {
      "id": "US-094",
      "title": "Add automatic header/footer detection and removal",
      "description": "Cross-page analysis to detect repeating headers and footers (page numbers, titles, company names) by comparing candidate regions across pages with fuzzy matching. Provide detect_page_regions() and extract_text_body(). Resolves #88.",
      "acceptanceCriteria": [
        "PageRegions struct: header (Option<BBox>), footer (Option<BBox>), body (BBox)",
        "Pdf::detect_page_regions(options) -> Vec<PageRegions> analyzes all pages",
        "Detection algorithm: extract top/bottom N% of each page, compare across pages with fuzzy matching",
        "Fuzzy matching masks variable elements (digits for page numbers, dates)",
        "Configurable: header_margin (top % to scan), footer_margin (bottom % to scan), min_pages (minimum pages for detection)",
        "Page::extract_text_body(regions) extracts text excluding header/footer regions",
        "Handles documents where headers/footers vary between odd/even pages",
        "Unit tests: repeating header detected across 3+ pages, page number in footer detected, no false positives on single-page PDF",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 3,
      "passes": true,
      "relatedIssue": 88,
      "notes": "No major PDF library provides this built-in. Significant differentiation opportunity."
    },
    {
      "id": "US-095",
      "title": "Improve reading order for multi-column layouts",
      "description": "Current layout-preserving text extraction produces incorrect reading order for multi-column documents. Implement column detection that clusters words by x-coordinate proximity, detects vertical gaps as column separators, and orders text column-by-column. Resolves #89.",
      "acceptanceCriteria": [
        "ColumnMode enum: None (current behavior), Auto (detect columns), Explicit(Vec<f64>) (user-specified column boundaries)",
        "column_mode field added to TextOptions (default None)",
        "Auto detection: cluster word x-coordinates, find gaps wider than threshold, split into columns",
        "Column-aware reading order: read all content in column 1 top-to-bottom, then column 2, etc.",
        "Full-width elements (headings, images) spanning multiple columns handled correctly",
        "Configurable: min_column_gap (minimum gap width to split), max_columns (upper limit)",
        "Unit tests: 2-column layout read in correct order, 3-column layout, full-width heading not split",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 4,
      "passes": false,
      "relatedIssue": 89,
      "notes": "Important for academic papers, newsletters, and magazine-style layouts."
    }
  ]
}
