{
  "project": "pdfplumber-rs",
  "branchName": "ralph/phase10-interpreter-fixes",
  "description": "Phase 10: Critical Interpreter Fixes - Path operators and Extended Graphics State wiring",
  "userStories": [
    {
      "id": "US-086",
      "title": "Wire path operators in content stream interpreter",
      "description": "This work is ALREADY IMPLEMENTED in PR #121 (branch origin/fix/content-stream-path-ops, commit 6acba75b). Do NOT reimplement from scratch. Instead: (1) git fetch origin fix/content-stream-path-ops, (2) git cherry-pick 6acba75b, (3) resolve any merge conflicts with main, (4) run cargo fmt --all to fix formatting issues (PR #121 failed the Format CI check), (5) verify cargo test/clippy/check all pass, (6) commit the fixes. The original implementation wires path construction operators (m, l, c, v, y, h, re), painting operators (S, s, f, F, f*, B, B*, b, b*, n), clipping operators (W, W*), dictionary parsing in tokenizer, and marked content operators (BMC/BDC/EMC) into the interpreter. Resolves #71.",
      "acceptanceCriteria": [
        "Cherry-pick commit 6acba75b from origin/fix/content-stream-path-ops successfully",
        "All merge conflicts resolved cleanly",
        "cargo fmt --all -- --check passes (the original PR failed this)",
        "Interpreter matches path construction operators: m, l, c, v, y, h, re",
        "Interpreter matches painting operators: S, s, f, F, f*, B, B*, b, b*, n",
        "Interpreter matches clipping operators: W, W*",
        "Tokenizer handles inline dictionaries (<< /Key value >>)",
        "page.lines(), page.rects(), page.curves() return non-empty results for appropriate PDFs",
        "Lattice table detection works on PDFs with bordered tables",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 1,
      "passes": true,
      "relatedIssue": 71,
      "notes": "DO NOT reimplement. Cherry-pick from existing PR #121 (commit 6acba75b). The PR had two issues: (1) cargo fmt failure, (2) merge conflicts with main after PR #119 was merged. Fix both and merge. After this story's PR is merged, close PR #121 as superseded: gh pr close 121 --comment 'Superseded by PR #N'"
    },
    {
      "id": "US-087",
      "title": "Wire Extended Graphics State (gs operator) in interpreter",
      "description": "The ExtGState struct and GraphicsState::apply_ext_gstate() already exist, but the interpreter never processes the gs operator. Wire the gs operator to look up named ExtGState from page resources and apply values (line width, dash pattern, stroke/fill alpha, font) to current graphics state. Resolves #73.",
      "acceptanceCriteria": [
        "Interpreter handles 'gs' operator: looks up operand name in page /Resources /ExtGState dictionary",
        "Parses ExtGState dictionary keys: /LW (line width), /D (dash pattern), /CA (stroke alpha), /ca (fill alpha), /Font (font array)",
        "Applies parsed values to current GraphicsState via apply_ext_gstate()",
        "Line width from ExtGState correctly affects subsequent path stroking",
        "Dash pattern from ExtGState correctly affects subsequent path stroking",
        "Alpha values from ExtGState available on extracted objects",
        "Font changes from ExtGState correctly affect subsequent text rendering",
        "Unknown ExtGState keys are silently ignored (forward compatibility)",
        "Unit tests: gs operator applies line width, gs operator applies dash pattern, gs operator applies alpha, missing ExtGState name produces warning not error",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 2,
      "passes": false,
      "relatedIssue": 73,
      "notes": "ExtGState infrastructure exists — only interpreter wiring needed. Common in real-world PDFs for setting transparency and line styles."
    }
  ]
}
