{
  "project": "pdfplumber-rs",
  "branchName": "ralph/standard-font-widths",
  "description": "Standard 14 Type1 Font Width Tables - Add built-in glyph width data for standard PDF fonts to fix char positioning in PDFs without embedded /Widths arrays",
  "userStories": [
    {
      "id": "US-103",
      "title": "Create standard_fonts.rs with width tables for all 14 Standard Type1 fonts",
      "description": "Create crates/pdfplumber-parse/src/standard_fonts.rs containing static [u16; 256] width arrays (in 1/1000 em-square units) for all 14 Standard Type1 fonts: Courier (4 variants), Helvetica (4 variants), Times-Roman (4 variants), Symbol, ZapfDingbats. Provide pub fn lookup(name: &str) -> Option<StandardFontData> that matches font names. Width data should be sourced from Adobe AFM specifications. Also add pub mod standard_fonts; to crates/pdfplumber-parse/src/lib.rs.",
      "acceptanceCriteria": [
        "Static width arrays exist for all 14 fonts: Courier, Courier-Bold, Courier-Oblique, Courier-BoldOblique, Helvetica, Helvetica-Bold, Helvetica-Oblique, Helvetica-BoldOblique, Times-Roman, Times-Bold, Times-Italic, Times-BoldItalic, Symbol, ZapfDingbats",
        "Each width array is [u16; 256] indexed by char code",
        "StandardFontData struct contains widths array and font_bbox",
        "lookup() returns Some for all 14 standard font names, None for unknown fonts",
        "Known width values match Adobe AFM: Helvetica 'A'(65)=667, space(32)=278, Courier 'A'(65)=600",
        "All 4 Courier variants have uniform 600-unit widths (monospaced)",
        "Module registered in lib.rs: pub mod standard_fonts",
        "Unit tests verify: known widths, all 14 fonts present, unknown font returns None",
        "cargo test -p pdfplumber-parse passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": "Width data from Adobe AFM files. Courier is monospaced (all 600). Helvetica/Times are proportional. Key file to register module: crates/pdfplumber-parse/src/lib.rs."
    },
    {
      "id": "US-104",
      "title": "Integrate standard font fallback in extract_font_metrics()",
      "description": "In crates/pdfplumber-parse/src/font_metrics.rs, after the existing code determines widths is empty (around line 159), add a fallback that checks if the font's /BaseFont name matches a Standard 14 font via standard_fonts::lookup(). If matched, use the standard width array instead of falling back to DEFAULT_WIDTH=600.0. Handle subset-prefixed font names (ABCDEF+Helvetica) via crate::cid_font::strip_subset_prefix(). The FontDescriptor's ascent/descent/missing_width should override standard values if present; use standard font_bbox if FontDescriptor lacks one.",
      "acceptanceCriteria": [
        "When /Widths array is absent and BaseFont is a standard font, uses standard widths instead of DEFAULT_WIDTH",
        "PDFs with embedded /Widths arrays are completely unaffected (no behavior change)",
        "Subset-prefixed fonts (ABCDEF+Helvetica) are handled via strip_subset_prefix()",
        "FontDescriptor ascent/descent values override standard defaults when present",
        "Standard font_bbox used as fallback when FontDescriptor bbox is absent",
        "Integration test: create a minimal PDF with Helvetica (no /Widths), verify char widths are proportional not fixed",
        "Existing font_metrics tests continue to pass",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": "Key file: crates/pdfplumber-parse/src/font_metrics.rs. The fallback goes after line ~159 where empty widths is determined. Use crate::cid_font::strip_subset_prefix (at cid_font.rs:621) for subset prefix handling. parse_font_descriptor() already exists in font_metrics.rs."
    },
    {
      "id": "US-105",
      "title": "Verify accuracy benchmark improvement for generated PDFs",
      "description": "After implementing the standard font fallback, run the accuracy benchmark tests and verify that generated PDF F1 scores improve significantly. Update thresholds in crates/pdfplumber/tests/accuracy_benchmark.rs to reflect the improved accuracy. Generated PDFs (basic_text, multicolumn, multi_font, etc.) that currently score 0.01-0.71 should improve to near 1.0 since they all use standard Type1 fonts.",
      "acceptanceCriteria": [
        "Run accuracy benchmark: cargo test -p pdfplumber --test accuracy_benchmark -- --nocapture",
        "Generated PDF char F1 scores improve significantly (most should reach >0.90)",
        "Generated PDF word F1 scores improve significantly",
        "Real-world PDF scores (pdffill-demo, nics-firearm-checks) remain unchanged or improve",
        "Accuracy benchmark test thresholds updated to new baselines with PRD targets as comments",
        "All accuracy benchmark tests pass with updated thresholds",
        "cargo test --workspace passes",
        "cargo clippy --workspace -- -D warnings passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": "Accuracy benchmark test file: crates/pdfplumber/tests/accuracy_benchmark.rs (on feat/accuracy-benchmark branch, PR #125). Golden data in tests/fixtures/golden/. Current baselines: basic_text char=0.05, multicolumn char=0.10. These should jump to near 1.0."
    }
  ]
}
